function newP = TranferCord(O,P)
%**************************************************************************
%**************************************************************************
%*  时间：2006年6月14日                                                    *
%*  函数目的：将任意多个点的坐标（x，y，z）转变为（X，Y，Z）                  *
%*  函数输入：O为xyz坐标系的原点在XYZ坐标系的坐标表示                        *
%*  续上，P为任意多个点的xyz坐标系中的三维坐标，第一行为x坐标，以此类推        *
%*  函数输出，newP为P所对应的XYZ坐标系的坐标表示                             *
%*  函数描述：O为球面上的点，P为任意点（以O为原点的坐标系oxyz中的坐标）        *
%*  续上，newP为点P在以球心为原点的直角坐标XYZ中的表示                       *
%**************************************************************************
%**************************************************************************

%假定球冠在XY的上部
O = O(:);

x0 = O(1);y0 = O(2);z0 = O(3);
%z轴与-O夹角
theta = acos(-z0/sqrt(x0*x0+y0*y0+z0*z0));
 
r2 = sqrt(x0*x0+y0*y0);
if r2<0.000001
    phi = 0.5*pi;
else
    phi = acos(-x0/r2);
end
if (-y0)<0
    phi = 2*pi-phi;
end

%Z轴在xoy平面的投影方向即为oy的反方向
%以z轴为旋转轴顺时针旋转90度，使得ox轴方向与Z轴在xoy平面的投影方向平行
%是否旋转关系不大，关键是x、y轴方向的选择
T1 = [ 0 1 0;
      -1 0 0;
       0 0 1];
   
%以当前y轴为旋转轴顺时针旋转theta，使得oz轴方向与Z轴方向平行                          
T2 = [cos(theta), 0, sin(theta);
        0,        1,    0;
     -sin(theta), 0, cos(theta)];

%以当前z轴为旋转轴顺时针旋转phi，使得oy轴方向与Y轴方向平行 
T3 = [cos(phi),-sin(phi),0;
      sin(phi),cos(phi), 0;
        0,      0,       1];                      
                          
P1 = T3*T2*T1*P;
deltaO =repmat(O,1,size(P1,2));
newP = P1+deltaO;%平移
%保角、保距